import fetch from 'node-fetch';
const handler = async (m, {conn, usedPrefix, usedPrefix: _p, __dirname, text, isPrems}) => {
  try {
  if (usedPrefix == 'a' || usedPrefix == 'A') return;

  const date = d.toLocaleDateString(locale, {day: 'numeric', month: 'long', year: 'numeric'});
  const {money, joincount} = global.db.data.users[m.sender];
  const {exp, limit, level, role} = global.db.data.users[m.sender];
  const pp = await conn.profilePictureUrl(conn.user.jid).catch(_ => 'https://telegra.ph/file/24fa902ead26340f3df2c.png');
    let fkon = { "key": { "participants":"0@s.whatsapp.net", "remoteJid": "status@broadcast", "fromMe": false, "id": "Halo" }, "message": { "contactMessage": { "vcard": `BEGIN:VCARD\nVERSION:3.0\nN:Sy;Bot;;;\nFN:y\nitem1.TEL;waid=${m.sender.split('@')[0]}:${m.sender.split('@')[0]}\nitem1.X-ABLabel:Ponsel\nEND:VCARD` }}, "participant": "0@s.whatsapp.net" }
   // await conn.reply(m.chat, '𝐸𝑗𝑒𝑐𝑢𝑡𝑎𝑛𝑑𝑜 𝑎𝑐𝑐𝑖𝑜̀𝑛,𝐸𝑛𝑣𝑖𝑎𝑛𝑑𝑜📍. . .', m, { contextInfo:{ forwardingScore: 2022, isForwarded: true, externalAdReply: {title: '🌟 𝗕𝘂𝗲𝗻𝗼𝘀 𝗱𝗶𝗮𝘀!!', body: 'bienvenido', sourceUrl: global.md, thumbnail: imagen1 }}})
//m.react('🐺');
    await conn.sendMessage(m.chat, { react: { text: '💖', key: m.key } })
  let txt =`
┏━━━━━━━━━━━━━━━━┓
┃ ✦⏤͟͟͞͞𝗖𝗔𝗝𝗔 𝗙𝗨𝗘𝗥𝗧𝗘⏤͟͟͞͞✦
┗━━━━━━━━━━━━━


┣[☆🖥 𝐄𝐧 𝐞𝐬𝐭𝐞 𝐦𝐞𝐧𝐮 𝐩𝐮𝐞𝐝𝐞𝐬 𝐠𝐮𝐚𝐫𝐝𝐚𝐫 𝐭𝐮𝐬 𝐦𝐞𝐧𝐬𝐚𝐣𝐞𝐬 𝐞 𝐚𝐮𝐝𝐢𝐨𝐬 𝐢𝐦𝐩𝐨𝐫𝐭𝐚𝐧𝐭𝐞𝐬.

┏━━━━━━━━━━━━━━━━┓
┃✦⏤͟͟͞͞𝗔𝗚𝗥𝗘𝗚𝗔𝗥 𝗔 𝗟𝗔 𝗟𝗜𝗦𝗧𝗔⏤͟͟͞͞✦
┗━━━━━━━━━━━━━

┣[☆🗒  𝐀𝐠𝐫𝐞𝐠𝐚𝐫𝐦𝐬𝐠 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎 (𝚁𝚎𝚜𝚙𝚘𝚗𝚍𝚎 𝚊 𝚞𝚗 𝚝𝚎𝚡𝚝𝚘).
┣[☆🗒  𝐀𝐠𝐫𝐞𝐠𝐚𝐫𝐯𝐧 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎 (𝚁𝚎𝚜𝚙𝚘𝚗𝚍𝚎 𝚊 𝚞𝚗𝚊 𝚗𝚘𝚝𝚊 𝚍𝚎 𝚟𝚘𝚣).
┣[☆🗒  𝐀𝐠𝐫𝐞𝐠𝐚𝐫𝐯𝐢𝐝𝐞𝐨 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎 (𝚁𝚎𝚜𝚙𝚘𝚗𝚍𝚎 𝚊 𝚞𝚗 𝚟𝚒𝚍𝚎𝚘).
┣[☆🗒  𝐀𝐠𝐫𝐞𝐠𝐚𝐫𝐚𝐮𝐝𝐢𝐨 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎 (𝚁𝚎𝚜𝚙𝚘𝚗𝚍𝚎 𝚊 𝚞𝚗 𝚊𝚞𝚍𝚒𝚘).
┣[☆🗒  𝐀𝐠𝐫𝐞𝐠𝐚𝐫𝐢𝐦𝐠 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎 (𝚁𝚎𝚜𝚙𝚘𝚗𝚍𝚎 𝚊 𝚞𝚗𝚊 𝚒𝚖𝚊𝚐𝚎𝚗).
┣[☆🗒  𝐀𝐠𝐫𝐞𝐠𝐚𝐫𝐬𝐭𝐢𝐜𝐤𝐞𝐫 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎 (𝚁𝚎𝚜𝚙𝚘𝚗𝚍𝚎 𝚊 𝚞ɴ 𝚜𝚝𝚒𝚌𝚔𝚎𝚛).

┏━━━━━━━━━━━━━━━━┓
┃✦⏤͟͟͞͞𝗟𝗜𝗦𝗧𝗔 𝗗𝗘 𝗖𝗢𝗠𝗔𝗡𝗗𝗢𝗦⏤͟͟͞͞✦
┗━━━━━━━━━━━━━

┣[☆🗒 𝐋𝐢𝐬𝐭𝐚𝐦𝐬𝐠.
┣[☆🗒 𝐋𝐢𝐬𝐭𝐚𝐯𝐧.
┣[☆🗒 𝐋𝐢𝐬𝐭𝐚𝐯𝐢𝐝𝐞𝐨.
┣[☆🗒 𝐋𝐢𝐬𝐭𝐚𝐚𝐮𝐝𝐢𝐨.
┣[☆🗒 𝐋𝐢𝐬𝐭𝐚𝐢𝐦𝐠.
┣[☆🗒 𝐋𝐢𝐬𝐭𝐚𝐬𝐭𝐢𝐜𝐤𝐞𝐫.

┏━━━━━━━━━━━━━━━━━━━┓
┃✦⏤͟͟͞͞𝗩𝗘𝗥 𝗧𝗘𝗫𝗧𝗢𝗦-𝗔𝗥𝗖𝗛𝗜𝗩𝗢𝗦⏤͟͟͞͞✦
┗━━━━━━━━━━━━━━━━━━

┣[☆🗒  𝐕𝐞𝐫𝐦𝐬𝐠 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐕𝐞𝐫𝐯𝐧 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐕𝐞𝐫𝐯𝐢𝐝𝐞𝐨 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐕𝐞𝐫𝐚𝐮𝐝𝐢𝐨 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐕𝐞𝐫𝐢𝐦𝐠 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐕𝐞𝐫𝐬𝐭𝐢𝐜𝐤𝐞𝐫 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.

┏━━━━━━━━━━━━━━━━┓
┃✦⏤͟͟͞͞ 𝗘𝗟𝗜𝗠𝗜𝗡𝗔𝗥⏤͟͟͞͞✦
┗━━━━━━━━━━━━━

┣[☆🗒  𝐄𝐥𝐢𝐦𝐢𝐧𝐚𝐫𝐦𝐬𝐠 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐄𝐥𝐢𝐦𝐢𝐧𝐚𝐫𝐯𝐧 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐄𝐥𝐢𝐦𝐢𝐧𝐚𝐫𝐯𝐢𝐝𝐞𝐨 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐄𝐥𝐢𝐦𝐢𝐧𝐚𝐫𝐚𝐮𝐝𝐢𝐨 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐄𝐥𝐢𝐦𝐢𝐧𝐚𝐫𝐢𝐦𝐠 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐄𝐥𝐢𝐦𝐢𝐧𝐚𝐫𝐬𝐭𝐢𝐜𝐤𝐞𝐫 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎  .
┗━━━━━━━━━━━━━

┣[☆🗒  𝐄𝐥𝐢𝐦𝐢𝐧𝐚𝐫𝐦𝐬𝐠 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐄𝐥𝐢𝐦𝐢𝐧𝐚𝐫𝐯𝐧 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐄𝐥𝐢𝐦𝐢𝐧𝐚𝐫𝐯𝐢𝐝𝐞𝐨 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐄𝐥𝐢𝐦𝐢𝐧𝐚𝐫𝐚𝐮𝐝𝐢𝐨 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐄𝐥𝐢𝐦𝐢𝐧𝐚𝐫𝐢𝐦𝐠 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐄𝐥𝐢𝐦𝐢𝐧𝐚𝐫𝐬𝐭𝐢𝐜𝐤𝐞𝐫 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.\n𝐿𝑜𝑏𝑜-𝐵𝑜𝑡-𝐿𝑖𝑡𝑒🐈🌻`  ;   await conn.sendMessage(m.chat, {text: txt.trim(), mentions: [...txt.matchAll(/@([0-9]{5,16}|0)/g)].map((v) => v[1] + '@s.whatsapp.net'), contextInfo: {forwardingScore: 9999999, isForwarded: true, mentionedJid: [...txt.matchAll(/@([0-9]{5,16}|0)/g)].map((v) => v[1] + '@s.whatsapp.net'), "externalAdReply": {"showAdAttribution": true, "containsAutoReply": true, "renderLargerThumbnail": true, "title": '𝐿𝑜𝑏𝑜-𝐵𝑜𝑡-𝐿𝑖𝑡𝑒 ✨️🍁', "containsAutoReply": true, "mediaType": 1, "thumbnail": [imagen6,imagen1,imagen4].getRandom(), "mediaUrl": global.md, "sourceUrl": global.md}}}, {quoted: m});
 // m.react('🐺');
  } catch {
    conn.reply(m.chat, '[⛔] 𝗙𝗮𝗹𝗹𝗼, 𝗘𝗹 𝗺𝗲𝗻𝘂 𝘁𝗶𝗲𝗻𝗲 𝘂𝗻 𝗲𝗿𝗿𝗼𝗿 𝗽𝗼𝗿 𝗳𝗮𝘃𝗼𝗿 𝗿𝗲𝗽𝗼𝗿𝘁𝗮𝗹𝗼 𝗮𝗹 𝘀𝘁𝗮𝗳𝗳.', m);
  }
};
handler.help = ['menucaja'];
handler.tags = ['menucaja'];
handler.command = /^(menucajafuerte|menucaja|ownercaja)$/i;
handler.register = true
export default handler;