import fetch from 'node-fetch';
const handler = async (m, {conn, usedPrefix, usedPrefix: _p, __dirname, text, isPrems}) => {
  try {
  if (usedPrefix == 'a' || usedPrefix == 'A') return;

  const date = d.toLocaleDateString(locale, {day: 'numeric', month: 'long', year: 'numeric'});
  const {money, joincount} = global.db.data.users[m.sender];
  const {exp, limit, level, role} = global.db.data.users[m.sender];
  const pp = await conn.profilePictureUrl(conn.user.jid).catch(_ => 'https://telegra.ph/file/24fa902ead26340f3df2c.png');
    let fkon = { "key": { "participants":"0@s.whatsapp.net", "remoteJid": "status@broadcast", "fromMe": false, "id": "Halo" }, "message": { "contactMessage": { "vcard": `BEGIN:VCARD\nVERSION:3.0\nN:Sy;Bot;;;\nFN:y\nitem1.TEL;waid=${m.sender.split('@')[0]}:${m.sender.split('@')[0]}\nitem1.X-ABLabel:Ponsel\nEND:VCARD` }}, "participant": "0@s.whatsapp.net" }
   // await conn.reply(m.chat, '𝐸𝑗𝑒𝑐𝑢𝑡𝑎𝑛𝑑𝑜 𝑎𝑐𝑐𝑖𝑜̀𝑛,𝐸𝑛𝑣𝑖𝑎𝑛𝑑𝑜📍. . .', m, { contextInfo:{ forwardingScore: 2022, isForwarded: true, externalAdReply: {title: '🌟 𝗕𝘂𝗲𝗻𝗼𝘀 𝗱𝗶𝗮𝘀!!', body: 'bienvenido', sourceUrl: global.md, thumbnail: imagen1 }}})
//m.react('🐺');
    await conn.sendMessage(m.chat, { react: { text: '💖', key: m.key } })
  let txt =`┏━━━━━━━━━━━━━━━━━━
┃⏤͟͟͞͞Lᴏʙᴏ - Bᴏᴛ - Lɪᴛᴇ
┗━━━━━━━━━━━━
┣⟣☯︎ 𝐸𝑛 𝐺𝑟𝑢𝑝𝑜𝑠: 𝙾𝚆𝙽𝙴𝚁
┣⟣☯︎ 𝐶𝑟𝑒𝑎𝑑𝑜𝑟: ᴛᴀʟʟʏᴄʟᴇʀᴋ
┣⟣☯︎ 𝑁𝑢𝑚𝑒𝑒𝑜: +505 5812 4470
┗━━━━━━━━━━━━━━━━━━━┛

┏━━━━━━━━━━━━━━━━┓
┃⏤͟͟͞͞𝙊𝙒𝙉𝙀𝙍𝙎 𝙔 𝗦𝗧𝗔𝗙𝗙
┗━━━━━━━━━━━━
    ✪ ⃟🍭𝐶𝑟𝑒𝑎𝑑𝑜𝑟𝑒𝑠 - 𝑆𝑡𝑎𝑓𝑓
┣🗂  > 𝚏𝚞𝚗𝚌𝚒𝚘𝚗
┣🗂  => 𝚏𝚞𝚗𝚌𝚒𝚘𝚗
┣🗂  $ 𝚏𝚞𝚗𝚌𝚒𝚘𝚗
┣🗂  𝐬𝐞𝐭𝐩𝐫𝐞𝐟𝐢𝐱 𝚙𝚛𝚎𝚏𝚒𝚓𝚘
┣🗂  𝐚𝐥𝐭𝐞𝐫𝐚𝐫 𝚗𝚞𝚖𝚎𝚛𝚘
┣🗂  𝐫𝐞𝐬𝐞𝐭𝐩𝐫𝐞𝐟𝐱
┣🗂  𝘁𝗲𝗻𝗲𝗿𝗽𝗼𝗱𝗲𝗿
┣🗂  𝐜𝐡𝐞𝐭𝐚𝐫
┣🗂  𝐬𝐚𝐥𝐢𝐫(𝐨𝐮𝐭 𝐛𝐨𝐭)
┣🗂  𝐜𝐚𝐣𝐚𝐟𝐮𝐞𝐫𝐭𝐞
┣🗂  𝐛𝐥𝐨𝐜𝐤𝐥𝐢𝐬𝐭
┣🗂  𝐛𝐥𝐨𝐜𝐤 @𝚝𝚊𝚐 / 𝚗𝚞𝚖𝚎𝚛𝚘
┣🗂  𝐮𝐧𝐛𝐥𝐨𝐜𝐤 @𝚝𝚊𝚐 / 𝚗𝚞𝚖𝚎𝚛𝚘

     ✪ ⃟🍧 𝐹𝑢𝑛𝑐𝑖𝑜𝑛𝑒𝑠 𝑆𝑡𝑎𝑓𝑓 - 𝑂𝑤𝑛𝑒𝑟𝑠

┣🌹  𝘁𝗿𝘂𝗲 𝚛𝚎𝚜𝚝𝚛𝚒𝚌𝚝
┣🌷  𝗳𝗮𝗹𝘀𝗲 𝚛𝚎𝚜𝚝𝚛𝚒𝚌𝚝
┣🌹  𝘁𝗿𝘂𝗲 𝚊𝚞𝚝𝚘𝚛𝚎𝚊𝚍
┣🌷  𝗳𝗮𝗹𝘀𝗲 𝚊𝚞𝚝𝚘𝚛𝚎𝚊𝚍
┣🌹  𝘁𝗿𝘂𝗲 𝚙𝚞𝚋𝚕𝚒𝚌
┣🌷  𝗳𝗮𝗹𝘀𝗲 𝚙𝚞𝚋𝚕𝚒𝚌
┣🌹  𝘁𝗿𝘂𝗲 𝚙𝚌𝚘𝚗𝚕𝚢
┣🌷  𝗳𝗮𝗹𝘀𝗲 𝚙𝚌𝚘𝚗𝚕𝚢
┣🌹  𝘁𝗿𝘂𝗲 𝚐𝚌𝚘𝚗𝚕𝚢
┣🌷  𝗳𝗮𝗹𝘀𝗲 𝚐𝚌𝚘𝚗𝚕𝚢
┣🌹  𝘁𝗿𝘂𝗲 𝚊𝚗𝚝𝚒𝚌𝚊𝚕𝚔
┣🌷  𝗳𝗮𝗹𝘀𝗲 𝚊𝚗𝚝𝚒𝚌𝚊𝚕𝚕
┣🌹  𝘁𝗿𝘂𝗲 𝚊𝚗𝚝𝚒𝚙𝚛𝚒𝚟𝚊𝚍𝚘
┣🌷  𝗳𝗮𝗹𝘀𝗲 𝚊𝚗𝚝𝚒𝚙𝚛𝚒𝚟𝚊𝚍𝚘
┣🌹  𝘁𝗿𝘂𝗲 𝚖𝚘𝚍𝚎𝚓𝚊𝚍𝚒𝚋𝚘𝚝
┣🌷  𝗳𝗮𝗹𝘀𝗲 𝚖𝚘𝚍𝚎𝚓𝚊𝚍𝚒𝚋𝚘𝚝
┣🌹  𝘁𝗿𝘂𝗲 𝚊𝚞𝚍𝚒𝚘𝚜_𝚋𝚘𝚝
┣🌷  𝗳𝗮𝗹𝘀𝗲 𝚊𝚞𝚍𝚒𝚘𝚜_𝚋𝚘𝚝
┣🌹  𝘁𝗿𝘂𝗲 𝚊𝚗𝚝𝚒𝚜𝚙𝚊𝚖
┣🌷  𝗳𝗮𝗹𝘀𝗲 𝙸𝚗𝚌𝚕𝚞𝚢
𝚎
     ✪ ⃟🍭𝑂𝑤𝑛𝑒𝑟 - 𝑆𝑡𝑎𝑓𝑓 - 𝐺𝑟𝑢𝑝𝑜𝑠

┣📕  𝐦𝐬𝐠 𝚝𝚎𝚡𝚝𝚘
┣📕  𝐫𝐞𝐮𝐧𝐢𝐨𝐧(𝐥𝐥𝐚𝐦𝐚𝐝𝐚 𝐨𝐰𝐧𝐞𝐫𝐬)
┣📕  𝗽𝗿𝗼𝗵𝗶𝗯𝗶𝗿𝗰𝗵𝗮𝘁
┣📕  𝗱𝗲𝘀𝗽𝗿𝗼𝗵𝗶𝗯𝗶𝗿𝗰𝗵𝗮𝘁
┣📕  𝗱𝗮𝘁𝗮0 @𝚝𝚊𝚐
┣📕  𝗽𝗿𝗼𝗵𝗶𝗯𝗶𝗿𝘂𝘀𝗲𝗿 @𝚝𝚊𝚐
┣📕  𝗱𝗲𝘀𝗽𝗿𝗼𝗵𝗶𝗯𝗶𝗿𝘂𝘀𝗲𝗿 @𝚝𝚊𝚐
┣📕  𝐝𝐚𝐫𝐝𝐢𝐚𝐦𝐚𝐧𝐭𝐞𝐬 @𝚝𝚊𝚐 𝚌𝚊𝚗𝚝𝚒𝚍𝚊𝚍
┣📕  𝐚𝐧̃𝐚𝐝𝐢𝐫𝐱𝐩 @𝚝𝚊𝚐 𝚌𝚊𝚗𝚝𝚒𝚍𝚊𝚍
┣📕  𝐛𝐜 𝚝𝚎𝚡𝚝𝚘
┣📕  𝐛𝐜𝐜𝐡𝐚𝐭𝐬 𝚝𝚎𝚡𝚝𝚘
┣📕  𝐛𝐜𝐠𝐜 𝚝𝚎𝚡𝚝𝚘
┣📕  𝐛𝐜𝐠𝐜𝟐 𝚊𝚞𝚍𝚒𝚘
┣📕  𝐛𝐜𝐠𝐜𝟐 𝚟𝚒𝚍𝚎𝚘
┣📕  𝐛𝐜𝐠𝐜𝟐 𝚒𝚖𝚊𝚐𝚎𝚗
┣📕  𝐛𝐜𝐛𝐨𝐭 𝚝𝚎𝚡𝚝𝚘
┣📕  𝐜𝐥𝐞𝐚𝐫𝐭𝐩𝐩
┣📕  𝐝𝐞𝐥𝐥𝐨𝐛𝐨/𝐥𝐨𝐛𝐨𝐝𝐞𝐥
┣📕  𝐫𝐞𝐬𝐭𝐚𝐫𝐭
┣📕  𝐮𝐩𝐝𝐚𝐭𝐞
┣📕  𝐛𝐚𝐧𝐥𝐢𝐬𝐭
┣📕  𝐚𝐝𝐝𝐩𝐫𝐞𝐦 @𝚝𝚊𝚐𝚝𝚒𝚎𝚖𝚙𝚘
┣📕  𝐚𝐝𝐝𝐩𝐫𝐞𝐦𝟐 @𝚝𝚊𝚐 𝚝𝚒𝚎𝚖𝚙𝚘
┣📕  𝐚𝐝𝐝𝐩𝐫𝐞𝐦𝟑 @𝚝𝚊𝚐 𝚝𝚒𝚎𝚖𝚙𝚘
┣📕  𝐚𝐝𝐝𝐩𝐫𝐞𝐦𝟒 @𝚝𝚊𝚐 𝚝𝚒𝚎𝚖𝚙𝚘
┣📕  𝐝𝐞𝐥𝐩𝐫𝐞𝐦 @𝚝𝚊𝚐
┣📕  𝐥𝐢𝐬𝐭𝐜𝐦𝐝
┣📕  𝐬𝐞𝐭𝐩𝐩𝐛𝐨𝐭 𝚛𝚎𝚜𝚙𝚘𝚗𝚍𝚎𝚛 𝚊 𝚒𝚖𝚊𝚐𝚎𝚗
┣📕  𝐚𝐝𝐝𝐜𝐦𝐝 𝚝𝚎𝚡𝚝𝚘 𝚛𝚎𝚜𝚙𝚘𝚗𝚍𝚎𝚛 𝚊 𝚜𝚝𝚒𝚌𝚔𝚎𝚛/𝚒𝚖𝚊𝚐𝚎𝚗
┣📕  𝐝𝐞𝐥𝐜𝐦𝐝 𝚛𝚎𝚜𝚙𝚘𝚗𝚍𝚎𝚛 𝚊 𝚜𝚝𝚒𝚌𝚔𝚎𝚛 /𝚒𝚖𝚊𝚐𝚎𝚗 𝚌𝚘𝚗 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚘 𝚝𝚎𝚡𝚝𝚘 𝚊𝚜𝚒𝚐𝚗𝚊𝚍𝚘
┣📕  𝐬𝐚𝐯𝐞𝐢𝐦𝐚𝐠𝐞
┣📕  𝐯𝐢𝐞𝐰𝐢𝐦𝐚𝐠𝐞
┗━━━━━━━━━━━━━━━━┛`;
   await conn.sendMessage(m.chat, {text: txt.trim(), mentions: [...txt.matchAll(/@([0-9]{5,16}|0)/g)].map((v) => v[1] + '@s.whatsapp.net'), contextInfo: {forwardingScore: 9999999, isForwarded: true, mentionedJid: [...txt.matchAll(/@([0-9]{5,16}|0)/g)].map((v) => v[1] + '@s.whatsapp.net'), "externalAdReply": {"showAdAttribution": true, "containsAutoReply": true, "renderLargerThumbnail": true, "title": '𝐿𝑜𝑏𝑜-𝐵𝑜𝑡-𝐿𝑖𝑡𝑒 ✨️🍁', "containsAutoReply": true, "mediaType": 1, "thumbnail": [imagen6,imagen1,imagen4].getRandom(), "mediaUrl": global.md, "sourceUrl": global.md}}}, {quoted: m});
 // m.react('🐺');
  } catch {
    conn.reply(m.chat, '[⛔] 𝗙𝗮𝗹𝗹𝗼, 𝗘𝗹 𝗺𝗲𝗻𝘂 𝘁𝗶𝗲𝗻𝗲 𝘂𝗻 𝗲𝗿𝗿𝗼𝗿 𝗽𝗼𝗿 𝗳𝗮𝘃𝗼𝗿 𝗿𝗲𝗽𝗼𝗿𝘁𝗮𝗹𝗼 𝗮𝗹 𝘀𝘁𝗮𝗳𝗳.', m);
  }
};
handler.help = ['menuowner'];
handler.tags = ['menuowner'];
handler.command = /^(ownermenu|Menuowner|OWnermenu|menuowner)$/i;
handler.register = true
export default handler;