const handler = async (m, {conn, usedPrefix}) => {
  const pp = imagen4;
  try {
  } catch (e) {
  } finally {
    const name = await conn.getName(m.sender);
    const taguser = '@' + m.sender.split('@s.whatsapp.net')[0];
    const str = `
┏━━━━━━━━━━━━━━━━┓
┃ ✦⏤͟͟͞͞𝗖𝗔𝗝𝗔 𝗙𝗨𝗘𝗥𝗧𝗘⏤͟͟͞͞✦
┗━━━━━━━━━━━━━

              ♥︎🐺𝗟𝗢𝗕𝗢-𝗕𝗢𝗧-𝗠𝗗🐺♥︎

┣[☆🖥 𝐄𝐧 𝐞𝐬𝐭𝐞 𝐦𝐞𝐧𝐮 𝐩𝐮𝐞𝐝𝐞𝐬 𝐠𝐮𝐚𝐫𝐝𝐚𝐫 𝐭𝐮𝐬 𝐦𝐞𝐧𝐬𝐚𝐣𝐞𝐬 𝐞 𝐚𝐮𝐝𝐢𝐨𝐬 𝐢𝐦𝐩𝐨𝐫𝐭𝐚𝐧𝐭𝐞𝐬.

┏━━━━━━━━━━━━━━━━┓
┃✦⏤͟͟͞͞𝗔𝗚𝗥𝗘𝗚𝗔𝗥 𝗔 𝗟𝗔 𝗟𝗜𝗦𝗧𝗔⏤͟͟͞͞✦
┗━━━━━━━━━━━━━

┣[☆🗒  𝐀𝐠𝐫𝐞𝐠𝐚𝐫𝐦𝐬𝐠 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎 (𝚁𝚎𝚜𝚙𝚘𝚗𝚍𝚎 𝚊 𝚞𝚗 𝚝𝚎𝚡𝚝𝚘).
┣[☆🗒  𝐀𝐠𝐫𝐞𝐠𝐚𝐫𝐯𝐧 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎 (𝚁𝚎𝚜𝚙𝚘𝚗𝚍𝚎 𝚊 𝚞𝚗𝚊 𝚗𝚘𝚝𝚊 𝚍𝚎 𝚟𝚘𝚣).
┣[☆🗒  𝐀𝐠𝐫𝐞𝐠𝐚𝐫𝐯𝐢𝐝𝐞𝐨 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎 (𝚁𝚎𝚜𝚙𝚘𝚗𝚍𝚎 𝚊 𝚞𝚗 𝚟𝚒𝚍𝚎𝚘).
┣[☆🗒  𝐀𝐠𝐫𝐞𝐠𝐚𝐫𝐚𝐮𝐝𝐢𝐨 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎 (𝚁𝚎𝚜𝚙𝚘𝚗𝚍𝚎 𝚊 𝚞𝚗 𝚊𝚞𝚍𝚒𝚘).
┣[☆🗒  𝐀𝐠𝐫𝐞𝐠𝐚𝐫𝐢𝐦𝐠 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎 (𝚁𝚎𝚜𝚙𝚘𝚗𝚍𝚎 𝚊 𝚞𝚗𝚊 𝚒𝚖𝚊𝚐𝚎𝚗).
┣[☆🗒  𝐀𝐠𝐫𝐞𝐠𝐚𝐫𝐬𝐭𝐢𝐜𝐤𝐞𝐫 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎 (𝚁𝚎𝚜𝚙𝚘𝚗𝚍𝚎 𝚊 𝚞ɴ 𝚜𝚝𝚒𝚌𝚔𝚎𝚛).

┏━━━━━━━━━━━━━━━━┓
┃✦⏤͟͟͞͞𝗟𝗜𝗦𝗧𝗔 𝗗𝗘 𝗖𝗢𝗠𝗔𝗡𝗗𝗢𝗦⏤͟͟͞͞✦
┗━━━━━━━━━━━━━

┣[☆🗒 𝐋𝐢𝐬𝐭𝐚𝐦𝐬𝐠.
┣[☆🗒 𝐋𝐢𝐬𝐭𝐚𝐯𝐧.
┣[☆🗒 𝐋𝐢𝐬𝐭𝐚𝐯𝐢𝐝𝐞𝐨.
┣[☆🗒 𝐋𝐢𝐬𝐭𝐚𝐚𝐮𝐝𝐢𝐨.
┣[☆🗒 𝐋𝐢𝐬𝐭𝐚𝐢𝐦𝐠.
┣[☆🗒 𝐋𝐢𝐬𝐭𝐚𝐬𝐭𝐢𝐜𝐤𝐞𝐫.

┏━━━━━━━━━━━━━━━━━━━┓
┃✦⏤͟͟͞͞𝗩𝗘𝗥 𝗧𝗘𝗫𝗧𝗢𝗦-𝗔𝗥𝗖𝗛𝗜𝗩𝗢𝗦⏤͟͟͞͞✦
┗━━━━━━━━━━━━━━━━━━

┣[☆🗒  𝐕𝐞𝐫𝐦𝐬𝐠 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐕𝐞𝐫𝐯𝐧 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐕𝐞𝐫𝐯𝐢𝐝𝐞𝐨 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐕𝐞𝐫𝐚𝐮𝐝𝐢𝐨 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐕𝐞𝐫𝐢𝐦𝐠 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐕𝐞𝐫𝐬𝐭𝐢𝐜𝐤𝐞𝐫 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.

┏━━━━━━━━━━━━━━━━┓
┃✦⏤͟͟͞͞ 𝗘𝗟𝗜𝗠𝗜𝗡𝗔𝗥⏤͟͟͞͞✦
┗━━━━━━━━━━━━━

┣[☆🗒  𝐄𝐥𝐢𝐦𝐢𝐧𝐚𝐫𝐦𝐬𝐠 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐄𝐥𝐢𝐦𝐢𝐧𝐚𝐫𝐯𝐧 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐄𝐥𝐢𝐦𝐢𝐧𝐚𝐫𝐯𝐢𝐝𝐞𝐨 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐄𝐥𝐢𝐦𝐢𝐧𝐚𝐫𝐚𝐮𝐝𝐢𝐨 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐄𝐥𝐢𝐦𝐢𝐧𝐚𝐫𝐢𝐦𝐠 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐄𝐥𝐢𝐦𝐢𝐧𝐚𝐫𝐬𝐭𝐢𝐜𝐤𝐞𝐫 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎  .
┗━━━━━━━━━━━━━

┣[☆🗒  𝐄𝐥𝐢𝐦𝐢𝐧𝐚𝐫𝐦𝐬𝐠 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐄𝐥𝐢𝐦𝐢𝐧𝐚𝐫𝐯𝐧 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐄𝐥𝐢𝐦𝐢𝐧𝐚𝐫𝐯𝐢𝐝𝐞𝐨 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐄𝐥𝐢𝐦𝐢𝐧𝐚𝐫𝐚𝐮𝐝𝐢𝐨 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐄𝐥𝐢𝐦𝐢𝐧𝐚𝐫𝐢𝐦𝐠 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.
┣[☆🗒  𝐄𝐥𝐢𝐦𝐢𝐧𝐚𝐫𝐬𝐭𝐢𝐜𝐤𝐞𝐫 𝚃𝚎𝚡𝚝𝚘 𝚌𝚘𝚖𝚊𝚗𝚍𝚘 𝚙𝚊𝚕𝚊𝚋𝚛𝚊 𝚌𝚕𝚊𝚟𝚎.`.trim();
    if (m.isGroup) {
      conn.sendMessage(m.chat, {image: pp, caption: str.trim(), mentions: [...str.matchAll(/@([0-9]{5,16}|0)/g)].map((v) => v[1] + '@s.whatsapp.net')}, {quoted: m});
    } else {
      const fkontak2 = {'key': {'participants': '0@s.whatsapp.net', 'remoteJid': 'status@broadcast', 'fromMe': false, 'id': 'Halo'}, 'message': {'contactMessage': {'vcard': `BEGIN:VCARD\nVERSION:3.0\nN:Sy;Bot;;;\nFN:y\nitem1.TEL;waid=${m.sender.split('@')[0]}:${m.sender.split('@')[0]}\nitem1.X-ABLabel:Ponsel\nEND:VCARD`}}, 'participant': '0@s.whatsapp.net'};
      conn.sendMessage(m.chat, {image: pp, caption: str.trim(), mentions: [...str.matchAll(/@([0-9]{5,16}|0)/g)].map((v) => v[1] + '@s.whatsapp.net')}, {quoted: fkontak2});
    }
    // conn.sendButton(m.chat, str, wm, pp, [['𝙼𝙴𝙽𝚄 𝙿𝚁𝙸𝙽𝙲𝙸𝙿𝙰𝙻', '/menu']], m, { mentions: [m.sender] })
  }
};
handler.help = ['cajafuerte'];
handler.tags = ['owner'];
handler.command = /^(cajafuerte)$/i;
handler.rowner = true;
handler.fail = null;
export default handler;
